<script setup lang="ts">
const description = ref('Лицензионный договор');

useHead({
  title: 'Лицензионный договор',
  meta: [
    { name: 'description', content: description }
  ],
});
</script>

<template>
  <main class="main">
    <section class="contract">
      <CommonBreadcrumb />
      <h1 class="contract-title">Лицензионный договор</h1>
      <div class="contract-list">
        <h2 class="contract-subtitle">
          Заголовок 1
        </h2>
        <p class="contract-list-item">
          Представленная тележка-дозатор обеспечивает высококачественную обработку любых территорий сыпучими противогололедными реагентами самых разных типов, включая такие тяжелые, как гранитная и мраморная крошка, песок и пескосоляные смеси. Тележка прекрасно подходит для использования во дворах многоквартирных домов, обработки территорий промышленных предприятий, востребована владельцами магазинов, различных коммерческих компаний. Кроме того, она может использоваться для высева семян на газонах, теннисных кортах и других территориях.
        </p>
        <p class="contract-list-item">
          Представленная тележка-дозатор обеспечивает высококачественную обработку любых территорий сыпучими противогололедными реагентами самых разных типов, включая такие тяжелые, как гранитная и мраморная крошка, песок и пескосоляные смеси.
        </p>

        <h2 class="contract-subtitle">
          Заголовок 2
        </h2>
        <p class="contract-list-item">
          Представленная тележка-дозатор обеспечивает высококачественную обработку любых территорий сыпучими противогололедными реагентами самых разных типов, включая такие тяжелые, как гранитная и мраморная крошка, песок и пескосоляные смеси.
        </p>

        <h2 class="contract-subtitle">
          Заголовок 3
        </h2>
        <p class="contract-list-item">
          Представленная тележка-дозатор обеспечивает высококачественную обработку любых территорий сыпучими противогололедными реагентами самых разных типов, включая такие тяжелые, как гранитная и мраморная крошка, песок и пескосоляные смеси. Тележка прекрасно подходит для использования во дворах многоквартирных домов, обработки территорий промышленных предприятий, востребована владельцами магазинов, различных коммерческих компаний. Кроме того, она может использоваться для высева семян на газонах, теннисных кортах и других территориях.
        </p>
        <p class="contract-list-item">
          Представленная тележка-дозатор обеспечивает высококачественную обработку любых территорий сыпучими противогололедными реагентами самых разных типов, включая такие тяжелые, как гранитная и мраморная крошка, песок и пескосоляные смеси.
        </p>
      </div>
    </section>
  </main>
</template>

<style lang="scss" scoped>
.contract {
  margin-top: 20px;
  padding-bottom: 79px;
}

.contract-title {
  font-size: var(--title-fs);
  font-weight: var(--bold-weight);
  margin: 20px 0 25px 0;
}

.contract-list {
  display: flex;
  flex-direction: column;
}

.contract-subtitle {
  font-size: var(--title-fs);
  font-weight: var(--bold-weight);
  color: rgba(56, 56, 56, 1);
  margin-top: 15px;
  margin-bottom: 25px;
}

.contract-list-item {
  font-size: 18px;
  margin-bottom: 15px;
}

@media (max-width: 768px) {
  .contract {
    margin-top: 24px;
    padding-bottom: 24px;
  }

  .contract-title {
    margin: 20px 0 5px 0;
  }

  .contract-subtitle {
    margin-bottom: 5px;
  }

  .contract-list-item {
    font-size: 15px;
  }
}
</style>